Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.ParameterValuesConflict
The value for [Parameter Name] must be at least [Value] below the value for [Parameter Name].

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidOrderOfPhases
Invalid order of phases: [Type Name] cannot be demolished before it was created.

Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.EnterNonNegativeValue
Enter a non-negative value.